{
  "tagline": "I hold a PhD in Computer Engineering, along with an M.E. in Computers from Thadomal Shahani Engineering College and a B.E. in Computers from VJTI. I currently serve as Deputy Head of Department and Assistant Professor in the Computer Science & Engineering (Data Science) Department at Vasai, Maharashtra. I bring over 19 years of teaching experience and more than 10 years of industry experience as a software programmer, freelancer, and consultant.\n\nI have conducted over 90 hands-on workshops in areas including IoT, web programming, Java programming, and machine learning. My research contributions include 51 publications in IEEE conferences, Scopus-indexed journals, and other international conferences. I have also served as session chairperson and co-chairperson for the subject Internet of Things – Considerations and Applications at the IEEE international conference IndiaCom, from 2016 through 2025, held in New Delhi.\n\nAdditionally, I have authored 10 books published by Nirali Prakashan, SybGen Publications, and Technowledge Publications, covering topics such as the Internet of Things, Internet Programming, DBMS, and Computer Networks. I am also the proprietor of YPP Technologies, Vasai.",
  "expertise": [
    {
      "name": "Java",
      "icon": "fa-brands fa-java",
      "description": "Architecting robust, scalable, and high-performance enterprise systems with a focus on clean, efficient code."
    },
    {
      "name": "Python",
      "icon": "fa-brands fa-python",
      "description": "Leveraging the full spectrum of Python's capabilities, from intricate data analysis and machine learning models to dynamic web applications."
    },
    {
      "name": "Machine Learning",
      "icon": "fa-solid fa-brain",
      "description": "Developing intelligent systems that uncover critical insights and drive automated decision-making from complex datasets."
    },
    {
      "name": "Internet of Things",
      "icon": "fa-solid fa-wifi",
      "description": "Engineering connected ecosystems that bridge the physical and digital worlds, creating responsive and data-rich environments."
    },
    {
      "name": "German Language",
      "icon": "fa-solid fa-language",
      "description": "A commitment to global communication and cross-cultural perspectives, enabling deeper engagement with international research."
    },
    {
      "name": "AI in Music Therapy",
      "icon": "fa-solid fa-music",
      "description": "Integrating machine learning algorithms with music theory to develop innovative therapeutic interventions for cognitive and emotional health."
    }
  ]
}